Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4480.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF13EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF13EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD87">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF13EID0" edc:desc="" edc:mask="0x1" edc:name="RXF13EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID1" edc:desc="" edc:mask="0x1" edc:name="RXF13EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID2" edc:desc="" edc:mask="0x1" edc:name="RXF13EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID3" edc:desc="" edc:mask="0x1" edc:name="RXF13EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID4" edc:desc="" edc:mask="0x1" edc:name="RXF13EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID5" edc:desc="" edc:mask="0x1" edc:name="RXF13EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID6" edc:desc="" edc:mask="0x1" edc:name="RXF13EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF13EID7" edc:desc="" edc:mask="0x1" edc:name="RXF13EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF14SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF14SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD88">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF14SID3" edc:desc="" edc:mask="0x1" edc:name="RXF14SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID4" edc:desc="" edc:mask="0x1" edc:name="RXF14SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID5" edc:desc="" edc:mask="0x1" edc:name="RXF14SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID6" edc:desc="" edc:mask="0x1" edc:name="RXF14SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID7" edc:desc="" edc:mask="0x1" edc:name="RXF14SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID8" edc:desc="" edc:mask="0x1" edc:name="RXF14SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID9" edc:desc="" edc:mask="0x1" edc:name="RXF14SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID10" edc:desc="" edc:mask="0x1" edc:name="RXF14SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF14SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF14SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD89">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF14EID16" edc:desc="" edc:mask="0x1" edc:name="RXF14EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID17" edc:desc="" edc:mask="0x1" edc:name="RXF14EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF14EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF14EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID0" edc:desc="" edc:mask="0x1" edc:name="RXF14SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID1" edc:desc="" edc:mask="0x1" edc:name="RXF14SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14SID2" edc:desc="" edc:mask="0x1" edc:name="RXF14SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF14EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF14EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD8A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF14EID8" edc:desc="" edc:mask="0x1" edc:name="RXF14EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID9" edc:desc="" edc:mask="0x1" edc:name="RXF14EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID10" edc:desc="" edc:mask="0x1" edc:name="RXF14EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID11" edc:desc="" edc:mask="0x1" edc:name="RXF14EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID12" edc:desc="" edc:mask="0x1" edc:name="RXF14EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID13" edc:desc="" edc:mask="0x1" edc:name="RXF14EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID14" edc:desc="" edc:mask="0x1" edc:name="RXF14EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID15" edc:desc="" edc:mask="0x1" edc:name="RXF14EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF14EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF14EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD8B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF14EID0" edc:desc="" edc:mask="0x1" edc:name="RXF14EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID1" edc:desc="" edc:mask="0x1" edc:name="RXF14EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID2" edc:desc="" edc:mask="0x1" edc:name="RXF14EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID3" edc:desc="" edc:mask="0x1" edc:name="RXF14EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID4" edc:desc="" edc:mask="0x1" edc:name="RXF14EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID5" edc:desc="" edc:mask="0x1" edc:name="RXF14EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID6" edc:desc="" edc:mask="0x1" edc:name="RXF14EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF14EID7" edc:desc="" edc:mask="0x1" edc:name="RXF14EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xD8C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF15SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF15SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD90">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF15SID3" edc:desc="" edc:mask="0x1" edc:name="RXF15SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID4" edc:desc="" edc:mask="0x1" edc:name="RXF15SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID5" edc:desc="" edc:mask="0x1" edc:name="RXF15SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID6" edc:desc="" edc:mask="0x1" edc:name="RXF15SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID7" edc:desc="" edc:mask="0x1" edc:name="RXF15SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID8" edc:desc="" edc:mask="0x1" edc:name="RXF15SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID9" edc:desc="" edc:mask="0x1" edc:name="RXF15SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID10" edc:desc="" edc:mask="0x1" edc:name="RXF15SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF15SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF15SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD91">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF15EID16" edc:desc="" edc:mask="0x1" edc:name="RXF15EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID17" edc:desc="" edc:mask="0x1" edc:name="RXF15EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF15EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF15EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID0" edc:desc="" edc:mask="0x1" edc:name="RXF15SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID1" edc:desc="" edc:mask="0x1" edc:name="RXF15SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15SID2" edc:desc="" edc:mask="0x1" edc:name="RXF15SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
