Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4480.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF15EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF15EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD92">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF15EID8" edc:desc="" edc:mask="0x1" edc:name="RXF15EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID9" edc:desc="" edc:mask="0x1" edc:name="RXF15EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID10" edc:desc="" edc:mask="0x1" edc:name="RXF15EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID11" edc:desc="" edc:mask="0x1" edc:name="RXF15EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID12" edc:desc="" edc:mask="0x1" edc:name="RXF15EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID13" edc:desc="" edc:mask="0x1" edc:name="RXF15EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID14" edc:desc="" edc:mask="0x1" edc:name="RXF15EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID15" edc:desc="" edc:mask="0x1" edc:name="RXF15EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF15EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF15EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD93">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF15EID0" edc:desc="" edc:mask="0x1" edc:name="RXF15EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID1" edc:desc="" edc:mask="0x1" edc:name="RXF15EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID2" edc:desc="" edc:mask="0x1" edc:name="RXF15EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID3" edc:desc="" edc:mask="0x1" edc:name="RXF15EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID4" edc:desc="" edc:mask="0x1" edc:name="RXF15EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID5" edc:desc="" edc:mask="0x1" edc:name="RXF15EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID6" edc:desc="" edc:mask="0x1" edc:name="RXF15EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF15EID7" edc:desc="" edc:mask="0x1" edc:name="RXF15EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="64" edc:_addr="0xD94"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFCON0" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDD4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXF0EN" edc:desc="" edc:mask="0x1" edc:name="RXF0EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF1EN" edc:desc="" edc:mask="0x1" edc:name="RXF1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF2EN" edc:desc="" edc:mask="0x1" edc:name="RXF2EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF3EN" edc:desc="" edc:mask="0x1" edc:name="RXF3EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF4EN" edc:desc="" edc:mask="0x1" edc:name="RXF4EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF5EN" edc:desc="" edc:mask="0x1" edc:name="RXF5EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF6EN" edc:desc="" edc:mask="0x1" edc:name="RXF6EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF7EN" edc:desc="" edc:mask="0x1" edc:name="RXF7EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFCON1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDD5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXF8EN" edc:desc="" edc:mask="0x1" edc:name="RXF8EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF9EN" edc:desc="" edc:mask="0x1" edc:name="RXF9EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF10EN" edc:desc="" edc:mask="0x1" edc:name="RXF10EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF11EN" edc:desc="" edc:mask="0x1" edc:name="RXF11EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF12EN" edc:desc="" edc:mask="0x1" edc:name="RXF12EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF13EN" edc:desc="" edc:mask="0x1" edc:name="RXF13EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF14EN" edc:desc="" edc:mask="0x1" edc:name="RXF14EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF15EN" edc:desc="" edc:mask="0x1" edc:name="RXF15EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2" edc:_addr="0xDD6"/>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="SDFLC" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="SDFLC" edc:nzwidth="0x8" edc:por="---00000" edc:_addr="0xDD8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLC0" edc:desc="" edc:mask="0x1" edc:name="FLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLC1" edc:desc="" edc:mask="0x1" edc:name="FLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLC2" edc:desc="" edc:mask="0x1" edc:name="FLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLC3" edc:desc="" edc:mask="0x1" edc:name="FLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLC4" edc:desc="" edc:mask="0x1" edc:name="FLC4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DFLC0" edc:desc="" edc:mask="0x1" edc:name="DFLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFLC1" edc:desc="" edc:mask="0x1" edc:name="DFLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFLC2" edc:desc="" edc:mask="0x1" edc:name="DFLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFLC3" edc:desc="" edc:mask="0x1" edc:name="DFLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DFLC4" edc:desc="" edc:mask="0x1" edc:name="DFLC4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
