Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4480.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B3SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B3SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE52">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3EID16" edc:desc="" edc:mask="0x1" edc:name="B3EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID17" edc:desc="" edc:mask="0x1" edc:name="B3EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B3EXID" edc:desc="" edc:mask="0x1" edc:name="B3EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SRR" edc:desc="" edc:mask="0x1" edc:name="B3SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID0" edc:desc="" edc:mask="0x1" edc:name="B3SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID1" edc:desc="" edc:mask="0x1" edc:name="B3SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3SID2" edc:desc="" edc:mask="0x1" edc:name="B3SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="B3EXIDE" edc:desc="" edc:mask="0x1" edc:name="B3EXIDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE53">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3EID8" edc:desc="" edc:mask="0x1" edc:name="B3EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID9" edc:desc="" edc:mask="0x1" edc:name="B3EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID10" edc:desc="" edc:mask="0x1" edc:name="B3EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID11" edc:desc="" edc:mask="0x1" edc:name="B3EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID12" edc:desc="" edc:mask="0x1" edc:name="B3EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID13" edc:desc="" edc:mask="0x1" edc:name="B3EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID14" edc:desc="" edc:mask="0x1" edc:name="B3EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID15" edc:desc="" edc:mask="0x1" edc:name="B3EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE54">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3EID0" edc:desc="" edc:mask="0x1" edc:name="B3EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID1" edc:desc="" edc:mask="0x1" edc:name="B3EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID2" edc:desc="" edc:mask="0x1" edc:name="B3EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID3" edc:desc="" edc:mask="0x1" edc:name="B3EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID4" edc:desc="" edc:mask="0x1" edc:name="B3EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID5" edc:desc="" edc:mask="0x1" edc:name="B3EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID6" edc:desc="" edc:mask="0x1" edc:name="B3EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3EID7" edc:desc="" edc:mask="0x1" edc:name="B3EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B3DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B3DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE55">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR_TXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR/TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B3DLC0" edc:desc="" edc:mask="0x1" edc:name="B3DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3DLC1" edc:desc="" edc:mask="0x1" edc:name="B3DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3DLC2" edc:desc="" edc:mask="0x1" edc:name="B3DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3DLC3" edc:desc="" edc:mask="0x1" edc:name="B3DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RB0" edc:desc="" edc:mask="0x1" edc:name="B3RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RB1" edc:desc="" edc:mask="0x1" edc:name="B3RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B3RXRTR" edc:desc="" edc:mask="0x1" edc:name="B3RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE56">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D00" edc:desc="" edc:mask="0x1" edc:name="B3D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D01" edc:desc="" edc:mask="0x1" edc:name="B3D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D02" edc:desc="" edc:mask="0x1" edc:name="B3D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D03" edc:desc="" edc:mask="0x1" edc:name="B3D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D04" edc:desc="" edc:mask="0x1" edc:name="B3D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D05" edc:desc="" edc:mask="0x1" edc:name="B3D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D06" edc:desc="" edc:mask="0x1" edc:name="B3D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D07" edc:desc="" edc:mask="0x1" edc:name="B3D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE57">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D10" edc:desc="" edc:mask="0x1" edc:name="B3D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D11" edc:desc="" edc:mask="0x1" edc:name="B3D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D12" edc:desc="" edc:mask="0x1" edc:name="B3D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D13" edc:desc="" edc:mask="0x1" edc:name="B3D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D14" edc:desc="" edc:mask="0x1" edc:name="B3D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D15" edc:desc="" edc:mask="0x1" edc:name="B3D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D16" edc:desc="" edc:mask="0x1" edc:name="B3D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D17" edc:desc="" edc:mask="0x1" edc:name="B3D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE58">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D20" edc:desc="" edc:mask="0x1" edc:name="B3D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D21" edc:desc="" edc:mask="0x1" edc:name="B3D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D22" edc:desc="" edc:mask="0x1" edc:name="B3D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D23" edc:desc="" edc:mask="0x1" edc:name="B3D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D24" edc:desc="" edc:mask="0x1" edc:name="B3D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D25" edc:desc="" edc:mask="0x1" edc:name="B3D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D26" edc:desc="" edc:mask="0x1" edc:name="B3D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D27" edc:desc="" edc:mask="0x1" edc:name="B3D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE59">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D30" edc:desc="" edc:mask="0x1" edc:name="B3D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D31" edc:desc="" edc:mask="0x1" edc:name="B3D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D32" edc:desc="" edc:mask="0x1" edc:name="B3D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D33" edc:desc="" edc:mask="0x1" edc:name="B3D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D34" edc:desc="" edc:mask="0x1" edc:name="B3D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D35" edc:desc="" edc:mask="0x1" edc:name="B3D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D36" edc:desc="" edc:mask="0x1" edc:name="B3D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D37" edc:desc="" edc:mask="0x1" edc:name="B3D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE5A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D40" edc:desc="" edc:mask="0x1" edc:name="B3D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D41" edc:desc="" edc:mask="0x1" edc:name="B3D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D42" edc:desc="" edc:mask="0x1" edc:name="B3D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D43" edc:desc="" edc:mask="0x1" edc:name="B3D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D44" edc:desc="" edc:mask="0x1" edc:name="B3D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D45" edc:desc="" edc:mask="0x1" edc:name="B3D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D46" edc:desc="" edc:mask="0x1" edc:name="B3D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D47" edc:desc="" edc:mask="0x1" edc:name="B3D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE5B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D50" edc:desc="" edc:mask="0x1" edc:name="B3D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D51" edc:desc="" edc:mask="0x1" edc:name="B3D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D52" edc:desc="" edc:mask="0x1" edc:name="B3D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D53" edc:desc="" edc:mask="0x1" edc:name="B3D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D54" edc:desc="" edc:mask="0x1" edc:name="B3D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D55" edc:desc="" edc:mask="0x1" edc:name="B3D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D56" edc:desc="" edc:mask="0x1" edc:name="B3D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D57" edc:desc="" edc:mask="0x1" edc:name="B3D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE5C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D60" edc:desc="" edc:mask="0x1" edc:name="B3D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D61" edc:desc="" edc:mask="0x1" edc:name="B3D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D62" edc:desc="" edc:mask="0x1" edc:name="B3D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D63" edc:desc="" edc:mask="0x1" edc:name="B3D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D64" edc:desc="" edc:mask="0x1" edc:name="B3D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D65" edc:desc="" edc:mask="0x1" edc:name="B3D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D66" edc:desc="" edc:mask="0x1" edc:name="B3D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D67" edc:desc="" edc:mask="0x1" edc:name="B3D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B3D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B3D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE5D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B3D70" edc:desc="" edc:mask="0x1" edc:name="B3D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D71" edc:desc="" edc:mask="0x1" edc:name="B3D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D72" edc:desc="" edc:mask="0x1" edc:name="B3D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D73" edc:desc="" edc:mask="0x1" edc:name="B3D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D74" edc:desc="" edc:mask="0x1" edc:name="B3D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D75" edc:desc="" edc:mask="0x1" edc:name="B3D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D76" edc:desc="" edc:mask="0x1" edc:name="B3D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3D77" edc:desc="" edc:mask="0x1" edc:name="B3D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="CANSTAT_RO6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="CANSTAT_RO6" edc:nzwidth="0x8" edc:por="10000000" edc:_addr="0xE5E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE1_ICODE0" edc:desc="" edc:mask="0x1" edc:name="EICODE1/ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE2_ICODE1" edc:desc="" edc:mask="0x1" edc:name="EICODE2/ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE3_ICODE2" edc:desc="" edc:mask="0x1" edc:name="EICODE3/ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EICODE4" edc:desc="" edc:mask="0x1" edc:name="EICODE4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE0" edc:desc="" edc:mask="0x1" edc:name="OPMODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE1" edc:desc="" edc:mask="0x1" edc:name="OPMODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPMODE2" edc:desc="" edc:mask="0x1" edc:name="OPMODE2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ICODE0" edc:desc="" edc:mask="0x1" edc:name="ICODE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE1" edc:desc="" edc:mask="0x1" edc:name="ICODE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE2" edc:desc="" edc:mask="0x1" edc:name="ICODE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE3" edc:desc="" edc:mask="0x1" edc:name="ICODE3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ICODE4" edc:desc="" edc:mask="0x1" edc:name="ICODE4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
