Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4480.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE61">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B4SID3" edc:desc="" edc:mask="0x1" edc:name="B4SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID4" edc:desc="" edc:mask="0x1" edc:name="B4SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID5" edc:desc="" edc:mask="0x1" edc:name="B4SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID6" edc:desc="" edc:mask="0x1" edc:name="B4SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID7" edc:desc="" edc:mask="0x1" edc:name="B4SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID8" edc:desc="" edc:mask="0x1" edc:name="B4SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID9" edc:desc="" edc:mask="0x1" edc:name="B4SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID10" edc:desc="" edc:mask="0x1" edc:name="B4SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="B4SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="B4SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xE62">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B4EID16" edc:desc="" edc:mask="0x1" edc:name="B4EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID17" edc:desc="" edc:mask="0x1" edc:name="B4EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="B4EXID" edc:desc="" edc:mask="0x1" edc:name="B4EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SRR" edc:desc="" edc:mask="0x1" edc:name="B4SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID0" edc:desc="" edc:mask="0x1" edc:name="B4SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID1" edc:desc="" edc:mask="0x1" edc:name="B4SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4SID2" edc:desc="" edc:mask="0x1" edc:name="B4SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="B4EXIDE" edc:desc="" edc:mask="0x1" edc:name="B4EXIDE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE63">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B4EID8" edc:desc="" edc:mask="0x1" edc:name="B4EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID9" edc:desc="" edc:mask="0x1" edc:name="B4EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID10" edc:desc="" edc:mask="0x1" edc:name="B4EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID11" edc:desc="" edc:mask="0x1" edc:name="B4EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID12" edc:desc="" edc:mask="0x1" edc:name="B4EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID13" edc:desc="" edc:mask="0x1" edc:name="B4EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID14" edc:desc="" edc:mask="0x1" edc:name="B4EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B4EID15" edc:desc="" edc:mask="0x1" edc:name="B4EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
